export const chapter11 = [
  {
    id: "11-1",
    chapter: 11,
    verse_number: "1",
    teluguSloka:
      "అర్జున ఉవాచ |\nమదనుగ్రహాయ పరమం గుహ్యమధ్యాత్మసంజ్ఞితమ్ |\nయత్త్వయోక్తం వచస్తేన మోహోఽయం విగతో మమ || 1 ||",
    word_meanings: [
      { word: "అర్జునః", meaning: "అర్జునుడు" },
      { word: "ఉవాచ", meaning: "పలికెను" },
      { word: "మత్-అనుగ్రహాయ", meaning: "నా మీద దయచే" },
      { word: "పరమం", meaning: "అత్యున్నతమైన" },
      { word: "గుహ్యం", meaning: "రహస్యమైన" },
      {
        word: "అధ్యాత్మ-సంజ్ఞితమ్",
        meaning: "ఆధ్యాత్మిక జ్ఞానమునకు సంబంధించిన",
      },
      { word: "యత్", meaning: "ఏది" },
      { word: "త్వయా", meaning: "నీచే" },
      { word: "ఉక్తం", meaning: "చెప్పబడినది" },
      { word: "వచః", meaning: "వాక్యములు" },
      { word: "తేన", meaning: "దానివల్ల" },
      { word: "మోహః", meaning: "మోహము" },
      { word: "అయం", meaning: "ఈ" },
      { word: "విగతః", meaning: "నశించిపోయింది" },
      { word: "మమ", meaning: "నా యొక్క" },
    ],
    meaning:
      "BG 11.1: అర్జునుడు పలికెను: నా మీద దయచే నీవు తెలియపరచిన ఈ యొక్క పరమ రహస్యమైన ఆధ్యాత్మిక జ్ఞానము విన్న తరువాత, నా మోహము ఇప్పుడు తొలగిపోయింది.",
    commentary:
      "శ్రీ కృష్ణుడు తన విభూతుల గురించి వివరించిన తర్వాత, తన మాటలు అర్జునులోనికి ప్రేరణను నింపాయి. ఆధ్యాత్మిక జ్ఞానములోని ఈ రహస్యాలను అర్థం చేసుకున్న అనంతరం, అర్జునుడు తన మోహాన్ని తొలగించుకున్నాడు. ఇతను ఇప్పుడు భగవంతుని వైభవాన్ని మరియు ఆధ్యాత్మికమైన పరిపూర్ణతను తెలుసుకొని, తన సందేహాలను తొలగించుకున్నాడు. ఈ అనుభవం అర్జునుని భగవద్భక్తి మరియు జ్ఞానాన్ని పెంచింది.",
  },
  {
    id: "11-2",
    chapter: 11,
    verse_number: "2",
    teluguSloka:
      "భవాప్యయౌ హి భూతానాం శ్రుతౌ విస్తరశో మయా |\nత్వత్తః కమలపత్రాక్ష మాహాత్మ్యమపి చావ్యయమ్ || 2 ||",
    word_meanings: [
      { word: "భవ", meaning: "ఉత్పత్తి" },
      { word: "అప్యయౌ", meaning: "లయము" },
      { word: "హి", meaning: "నిజముగా" },
      { word: "భూతానాం", meaning: "సర్వ ప్రాణుల" },
      { word: "శ్రుతౌ", meaning: "విన్నాను" },
      { word: "విస్తరశః", meaning: "విస్తారముగా" },
      { word: "మయా", meaning: "నా చేత" },
      { word: "త్వత్తః", meaning: "నీ నుండి" },
      { word: "కమల-పత్ర-అక్ష", meaning: "తామర పత్రమువంటి కన్నులు కలవాడా" },
      { word: "మాహాత్మ్యం", meaning: "గొప్పతనము" },
      { word: "అపి", meaning: "కూడా" },
      { word: "చ", meaning: "మరియు" },
      { word: "అవ్యయమ్", meaning: "నిత్యమైన" },
    ],
    meaning:
      "BG 11.2: సర్వ ప్రాణుల ఉత్పత్తి మరియు లయము విషయమును నీ నుండి విస్తారముగా విన్నాను, ఓ తామర పత్రమువంటి కన్నులు కలవాడా! అలాగే నిత్యమైన నీ మహాత్మ్యమును కూడా వినగలిగాను.",
    commentary:
      "సమస్త భౌతిక జగత్తు సృష్టికి మరియు లయమైపోవటానికి మూల కారణమైన శ్రీ కృష్ణుడి అత్యున్నత స్థాయిని విశ్వసిస్తూ అర్జునుడు, శ్రీ కృష్ణుని మహాత్మ్యమును ప్రశంసించటం కొనసాగిస్తూనే ఉన్నాడు. శ్రీ కృష్ణుడిని కమల-పత్రాక్ష, అని సంబోధిస్తున్నాడు అంటే, ‘పెద్దవిగా, సుతిమెత్తగా, అందముగా మరియు మాధుర్యము, సౌకుమార్యము వంటి గుణములు కలిగిన తామర పూవు వంటి నేత్రములు కలవాడా అని అర్థం.’\n\nఈ శ్లోకంలో అర్జునుడు అనేదేమిటంటే, ‘ఓ శ్రీ కృష్ణా, నీ యొక్క నిత్య-శాశ్వతమైన మహాద్భుతమైన మహిమలను నీ నుండి విన్నాను. నీవు అందరిలోనే ఉన్నా, నీవు వాటి యొక్క దోషములకు అతీతుడవు (అవి నీకు అంటవు). నీవే సర్వోన్నత నియామకుడవు అదే సమయంలో, నీవు అకర్తవు మరియు మా యొక్క కర్మలకు నీవు బాధ్యుడువి కావు. నీవే మా కర్మ ఫలితములను అందించేవాడవు అయినా నీవు నిష్పక్షపాతమైనవాడివి మరియు అందరికీ సమానుడవు. నీవే సర్వసాక్షివి మరియు కర్మ ఫలాలను అందించేవాడివి. అందుకే నీవే సర్వ ప్రాణులకూ ఆరాధ్యుడవు అని విశ్వసిస్తున్నాను.’",
  },
];
