// app/chapter/[id].tsx

import { View, FlatList, StyleSheet, Pressable } from "react-native";
import { Text } from "react-native-paper";
import { useLocalSearchParams, Link, Stack } from "expo-router";
import { Ionicons } from "@expo/vector-icons";
import { SafeAreaView } from "react-native-safe-area-context";

// Chapters
import { chapter1 } from "../verse/chapter1";
import { chapter2 } from "../verse/chapter2";
import { chapter3 } from "../verse/chapter3";
import { chapter4 } from "../verse/chapter4";
import { chapter5 } from "../verse/chapter5";
import { chapter6 } from "../verse/chapter6";
import { chapter7 } from "../verse/chapter7";
import { chapter8 } from "../verse/chapter8";
import { chapter9 } from "../verse/chapter9";
import { chapter10 } from "../verse/chapter10";
import { chapter11 } from "../verse/chapter11";
import { chapter12 } from "../verse/chapter12";
import { chapter13 } from "../verse/chapter13";
import { chapter14 } from "../verse/chapter14";
import { chapter15 } from "../verse/chapter15";
import { chapter16 } from "../verse/chapter16";
import { chapter17 } from "../verse/chapter17";
import { chapter18 } from "../verse/chapter18";

// Styles
import { chapterstyles } from "../styles";

// This would eventually come from your data source
const getChapterData = (id: string) => {
  const chapters = [
    {
      id: 1,
      chapter_number: "1వ అధ్యాయము",
      yogam_name: "అర్జున విషాద యోగము",
      description:
        "\t\t\t దాయాదులైన కౌరవులు, పాండవుల మధ్య మొదలవ్వబోతున్న గొప్ప మహాభారత సంగ్రామ యుద్ధభూమి యందు భగవద్గీత చెప్పబడింది. ఈ భారీ యుద్ధానికి దారి తీసిన పరిణామాల యొక్క వివరణాత్మక వర్ణన ఈ పుస్తకం యొక్క ఉపోద్ఘాతంలో, భగవద్గీత సమయ పరిస్థితి అనే భాగంలో చెప్పబడింది.\n\t\t\t ధృతరాష్ట్ర మహారాజు మరియు అతని మంత్రి సంజయుడికి మధ్య జరిగిన సంభాషణ రూపంలో భగవద్గీత విశదీకరింపబడటం మొదలౌతుంది. ధృతరాష్ట్రుడు అంధుడైన కారణం చేత, తానే స్వయంగా యుద్ధభూమి యందు లేడు, అందుకే సంజయుడు అతనికి యుద్ధరంగ విశేషాలని యథాతథంగా చెప్తున్నాడు. సంజయుడు, మహాభారతాన్ని రచించిన మహాత్ముడైన వేద వ్యాసుని శిష్యుడు. వేద వ్యాసునికి సుదూరంలో జరిగే విషయాలని చూసే దివ్యశక్తి వుంది. అదే శక్తిని సంజయుడికి, యుద్ధభూమిలో జరిగే విశేషాలని ధృతరాష్ట్రునికి వివరించటానికి, ఆయన ప్రసాదించాడు.",
      verses: chapter1,
    },
    {
      id: 2,
      chapter_number: "2వ అధ్యాయము",
      yogam_name: "సాంఖ్య యోగము",
      description:
        "\t\t\tఈ అధ్యాయములో అర్జునుడు, పరిస్థితిని తట్టుకోవడంలో ఉన్న తన పూర్తి అశక్తతని పునరుద్ఘాటించి, ఆసన్నమైన యుద్ధంలో తన విధిని నిర్వర్తించడానికి నిరాకరిస్తాడు. ఆ తరువాత శ్రీ కృష్ణుడిని తన ఆధ్యాత్మిక గురువుగా ఉండమని పద్ధతి ప్రకారముగా, మర్యాదపూర్వకంగా ప్రాధేయపడి, తను ఉన్న ఈ పరిస్థితిలో ఏమి చెయ్యాలో తనకు దిశానిర్దేశము చేయమని శ్రీ కృష్ణుడిని బ్రతిమాలతాడు. శరీరము నశించినా, నశించిపోని, మరణము లేని ఆత్మ గురించి చెప్పటం ద్వారా దివ్య జ్ఞానాన్ని విశదీకరించటం ప్రారంభిస్తాడు, ఆ పరమాత్మ. ఒక మనిషి పాత బట్టలు త్యజించి, ఎలాగైతే కొత్త బట్టలు ధరిస్తాడో, ఆత్మ అనేది కేవలం ఒక జీవిత కాలం నుండి ఇంకో జీవిత కాలానికి శరీరాలను మార్చుకుంటుంది. ఆ తరువాత శ్రీ కృష్ణుడు సామాజిక బాధ్యతల గురించి ప్రస్తావిస్తాడు. ధర్మాన్ని పరిరక్షించడానికి యుద్ధం చేయవలసిన తన క్షత్రియ బాధ్యతలను అర్జునుడికి గుర్తుచేస్తాడు. సామాజిక బాధ్యతని నిర్వర్తించటం ఒక పవిత్రమైన ధర్మమని, అది స్వర్గలోకాల వైపు దారి చూపుతుందని, అదేసమయంలో, కర్తవ్య ఉల్లంఘన వలన అవమానము, మరియు అపకీర్తి కలుగుతాయని చెప్తాడు.\n \t\t\t    అర్జునుడిని ప్రాపంచిక స్థాయిలో ఉత్తేజిత పరిచిన శ్రీ కృష్ణుడు, తదుపరి, కర్మ శాస్త్రాన్ని లోతుగా విశదీకరిస్తాడు. కర్మ ఫలాలపై అనురక్తి పెంచుకోకుండా కర్మలను ఆచరించమని అర్జునుడికి సూచిస్తాడు. ప్రతిఫలాన్ని ఆశించకుండా కర్మలని ఆచరించడాన్ని 'బుద్ధి యోగము' అంటాడు. బుద్ధిని ఉపయోగించి మనము కర్మ ప్రతిఫల కాంక్షని నిగ్రహించాలి. ఇలాంటి దృక్పథంతో పని చేస్తే, బంధాన్ని కలిగించే కర్మలే, బంధ-నాశక కర్మలుగా మారిపోయి, అర్జునుడు దుఃఖ రహిత స్థితికి చేరుకుంటాడు. \n\t\t\t    దివ్య జ్ఞానంలో స్థితులై ఉన్న వారి లక్షణాల గురించి అర్జునుడు అడుగుతాడు. దానికి జవాబుగా, శ్రీ కృష్ణుడు, ఆధ్యాత్మిక జ్ఞానంలో స్థితులై ఉన్న వారు మోహము, భయం, మరియు క్రోధములకు అతీతంగా ఎలా ఉంటారో విశదీకరించాడు. వారు సుఖ-దుఃఖాలను సమానంగా స్వీకరిస్తూ, అన్ని పరిస్థితులలో ప్రశాంతంగా ఉంటారు; వారి ఇంద్రియములు నిగ్రహించబడి ఉంటాయి; వారి మనస్సు ఎప్పుడూ భగవంతునిలో లీనమై ఉంటుంది; మానసిక క్లేశములైన - కామము, క్రోధము, మరియు లోభములు - ఎలా ఎదుగుతాయో, మరియు వాటిని ఎలా నిర్మూలించవచ్చో, దశల వారీగా శ్రీ కృష్ణుడు విశదీకరిస్తాడు.",
      verses: chapter2,
    },
    {
      id: 3,
      chapter_number: "3వ అధ్యాయము",
      yogam_name: "కర్మ యోగము",
      description:
        "\t\t\tఅన్ని ప్రాణులూ తమ తమ ప్రకృతి సిద్ధమైన స్వాభావిక లక్షణంచే ఏదో ఒక పని చేస్తూనే ఉంటాయనీ, మరియు ఎవరూ కూడా ఒక్క క్షణం కూడా కర్మలు చేయకుండా ఉండలేరనీ, ఈ అధ్యాయంలో వివరిస్తున్నాడు, శ్రీ కృష్ణుడు. ఏవో కాషాయి వస్త్రాలు ధరించి బాహ్యంగా సన్యాసం ప్రదర్శిస్తూ, లోలోన ఇంద్రియ వస్తువులపై చింతనచేసే వారు కపటులు. వారికన్నా, బాహ్యంగా కర్మలు ఆచరిస్తూనే ఉన్నా, లోనుండి మమకార రాహిత్యంతో ఉండే, కర్మ యోగము ఆచరించే వారు, ఉన్నతమైన వారు. భగవంతుని సృష్టి వ్యవస్థలో ప్రతి ప్రాణికి తన వంతుగా నిర్వర్తించే బాధ్యతలు ఉంటాయని శ్రీ కృష్ణుడు తదుపరి వక్కాణిస్తున్నాడు. మనము చేయవలసిన ధర్మాన్ని భగవంతుడు ఇచ్చిన కర్తవ్యంగా చేసినప్పుడు ఆ పని 'యజ్ఞం' అవుతుంది. యజ్ఞం చేయటం సహజంగానే దేవతలకు ప్రీతి కలిగిస్తుంది, దాంతో వారు భౌతిక అభ్యుదయం ప్రసాదిస్తారు. అలాంటి యజ్ఞం వానలు కురిపిస్తుంది, వానలతో జీవనాధారమైన ధాన్యం వస్తుంది. ఈ చక్రంలో తమ బాధ్యతని స్వీకరించటానికి నిరాకరించిన వారు పాపిష్టులు; వారు తమ ఇంద్రియ లౌల్యం కోసమే జీవించేవారు మరియు వారి జీవితాలు వ్యర్థమైనవి.\n\t\t\tఆత్మ యందే స్థితులై ఉండే జ్ఞానోదయమైనవారు, సామాన్య జనులలా కాకుండా, తమ శారీరక బాధ్యతలను నిర్వర్తించే అవసరం లేదు, ఎందుకంటే వారు ఉన్నతమైన ఆత్మ స్థాయి విధులు నిర్వర్తిస్తుంటారు కాబట్టి. కానీ వారు తమ సామాజిక విధులను విస్మరిస్తే, అది పెద్దవారి అడుగు జాడలలో నడిచే సామాన్య జనుల మనస్సులలో కలత కలిగిస్తుంది. కాబట్టి, అందరూ అనుకరించటానికి, ప్రపంచానికి ఒక మంచి ఉదాహరణ చూపటం కోసం జ్ఞానులు, ఎలాంటి స్వార్థ ప్రయోజనం లేకుండా కర్మలు ఆచరిస్తూనే ఉండాలి. ఇది, అజ్ఞానులు పరిపక్వత లేకుండా అకాలంగా తమ విధులను త్యజించటాన్ని ఇది నిరోధిస్తుంది. ఈ ప్రయోజనం కోసమే జ్ఞానోదయమైన జనక మహారాజు వంటి రాజులు, తమ కార్యకలాపాలను నిర్వర్తించారు.\n\t\t\t    తమకు ఇష్టం లేకపోయినా, ఏదో బలవంతమైన ప్రభావం చేతనా అన్నట్టు, జనులు ఎందుకు పాపపు కర్మలను చేస్తారు అని తదుపరి అర్జునుడు ప్రశ్నిస్తాడు. ప్రపంచంలో అన్నిటినీ నాశనం చేసే పాపిష్టి శత్రువు కామమే అని, ఆ పరమాత్మ వివరిస్తాడు. నిప్పు పొగచే మరియు అద్దం దుమ్ముచే కప్పి వేయబడ్డట్టుగా, కోరికలు జ్ఞానాన్ని కప్పివేసి, బుద్ధిని దూరంగా లాగేస్తాయి. తదుపరి, శ్రీ కృష్ణుడు, పాప స్వరూపమైన, కోరికలు అనే శత్రువుని సంహరించమని మరియు తన ఇంద్రియములు, మనస్సు, బుద్ధిని నియంత్రణలోకి తెమ్మని, అర్జునుడికి శంఖారావ పిలుపునిస్తున్నాడు.",
      verses: chapter3,
    },
    {
      id: 4,
      chapter_number: "4వ అధ్యాయము",
      yogam_name: "జ్ఞాన, కర్మ, సన్న్యాస యోగము",
      description:
        "\t\t\tనాలుగవ అధ్యాయంలో, శ్రీ కృష్ణుడు, తను ఉపదేశించే ఈ జ్ఞానంపై, దాని యొక్క సనాతనమైన మూలాన్ని తెలియచేయటం ద్వారా, అర్జునుడి విశ్వాసాన్ని దృఢపరుస్తున్నాడు. ఈ సనాతనమైన శాస్త్రాన్ని తాను ప్రారంభంలో సూర్య భగవానుడికి చెప్పానని, ఆ తరువాత పరంపరగా మహాత్ములైన రాజులకు అందించబడింది అని కృష్ణుడు వివరించాడు. ఇప్పుడు అదే మహోన్నతమైన యోగ శాస్త్రమును, తన ప్రియ మిత్రుడు, భక్తుడు అయిన అర్జునుడికి తెలియపరుస్తున్నాడు. ఇప్పుడు ప్రస్తుతం తన కళ్ళెదురుగా ఉన్న శ్రీ కృష్ణుడు, ఎన్నో యుగాల క్రితం సూర్య భగవానునికి ఈ శాస్త్రాన్ని ఎలా చెప్పాడని అర్జునుడు అడుగుతాడు. జవాబుగా, శ్రీ కృష్ణుడు తన అవతార దివ్య రహస్యాన్ని తెలియపరుస్తాడు. భగవంతుడు సనాతనుడు, పుట్టుకలేని వాడు అయినా, తన యోగమాయా శక్తిచే, ధర్మాన్ని పరిరక్షించటానికి, ఈ భూలోకం లోకి దిగివస్తాడని చెప్తాడు. కానీ, ఆయన జన్మ, కర్మలు దివ్యమైనవి, అవి ఎన్నటికీ భౌతిక దోషములచే కళంకితం కావు. ఈ రహస్యం తెలిసినవారు, దృఢవిశ్వాసంతో భక్తిలో నిమగ్నమౌతారు, మరియు ఆయనను పొందిన తరువాత, ఈ లోకంలో తిరిగి జన్మనెత్తరు.\n\t\t\t    తదుపరి, ఈ అధ్యాయం, కర్మల స్వభావాన్ని విశదీకరిస్తుంది మరియు - కర్మ, అకర్మ, మరియు వికర్మ అనబడే మూడు సూత్రాలను వివరిస్తుంది. ఏంతో నిమగ్నమైన పనులలో ఉన్నా, కర్మ యోగులు,  ఏవిధంగా అకర్మ స్థితిలో ఉంటారో, తద్వారా ఎలా కర్మ బంధాలలో చిక్కుకోరో ఇది వివరిస్తుంది. ఈ విజ్ఞానంతో ప్రాచీన మునులు - జయాపజయాలతో సంబంధం లేకుండా, సుఖ-దుఃఖాలను ఒకేలాగ పరిగణిస్తూ, కేవలం ఒక యజ్ఞం లాగా భగవంతుని ప్రీతి కోసం తమ పనులను/కర్మలను ఆచరించేవారు. యజ్ఞం అనేది అనేక రకాలుగా ఉంటుంది, అందులో చాలా రకాలు ఇక్కడ చెప్పబడ్డాయి. యజ్ఞం అనేది సరిగ్గా అర్పణచేయబడ్డప్పుడు దాని అవశేషం అమృతంలా అవుతుంది. అలాంటి అమృతం స్వీకరించినప్పుడు, కర్తలు మలిన శుద్ధి చేయబడుతారు. కాబట్టి యజ్ఞం అనేది ఎప్పుడైనా సరైన దృక్పథంతో, సరైన జ్ఞానంతో చెయ్యబడాలి. ఈ జ్ఞానమనే నావ సహాయంతో ఘోర పాపాత్ములు కూడా లౌకిక దుఃఖ సాగరాన్ని దాటవచ్చు. పరమ సత్యాన్ని అనుభవపూర్వకంగా తెలుసుకున్న ఒక నిజమైన ఆధ్యాత్మిక గురువు ద్వారా, ఇటువంటి జ్ఞానాన్ని నేర్చుకోవాలి. అర్జునుడి గురువుగా, అతన్ని జ్ఞానమనే ఖడ్గం తీసుకుని తన హృదయంలో జనించిన సందేహాలని ముక్కలుగా ఖండించి, లేచి తన కర్తవ్యాన్ని నిర్వర్తించమంటున్నాడు, శ్రీ కృష్ణుడు.",
      verses: chapter4,
    },
    {
      id: 5,
      chapter_number: "5వ అధ్యాయము",
      yogam_name: "కర్మ సన్యాస యోగము",
      description:
        "\t\t\tఈ అధ్యాయం 'కర్మ సన్యాస' (పనులను త్యజించటం) మార్గాన్ని 'కర్మ యోగ' (భక్తి యుక్తంగా పనిచేయటం) మార్గంతో పోల్చి చూపుతుంది. రెండూ కూడా ఒకే లక్ష్యం దిశగా దారితీస్తాయని, మనం వీటిలో దేనినైనా ఎంచుకోవచ్చు, అని శ్రీ కృష్ణుడు వివరిస్తున్నాడు. కానీ, మనస్సు ఎంతో పరిశుద్ధమైనదిగా ఉంటే తప్ప కర్మ సన్యాసం అనేది పరిపూర్ణంగా/దోషరహితంగా చేయలేము, మరియు భక్తితో పనిచేయటం ద్వారానే ఆ చిత్త శుద్ధి సాధించవచ్చు. కాబట్టి, కర్మ యోగమే సాధారణంగా చాలామందికి సరియైన దారి. కర్మ యోగులు తమ ప్రాపంచిక విధులను పవిత్రమైన బుద్ధితో, ఫలాసక్తి విడిచి, భగవత్ అర్పితముగా చేస్తారు. ఈ విధముగా, తామరాకుకు తాను తేలియాడే నీటి యొక్క తడి అంటనట్టు, వారికి పాపము అంటదు. \n\t\t\t    జ్ఞాన ప్రకాశంచే వారు ఈ శరీరము అనేది, ఆత్మ వసించే నవ ద్వారాల నగరమని తెలుసుకుంటారు. ఈ విధంగా, వారు తాము కర్తలము కాము అని, తాము భోక్తలము కూడా కాము అని తెలుసుకుంటారు. వారు అందరి పట్ల సమత్వ దృష్టి కలిగి ఉంటారు, ఒక బ్రాహ్మణుడు, ఆవు, ఏనుగు, కుక్క, చండాలుడు అందరినీ సమానంగా చూస్తారు. అటువంటి నిజమైన జ్ఞానులైన జనులు దోషరహిత మైన దైవీ గుణాలు పెంపొందించుకొంటారు మరియు పరమ సత్యము యందు స్థితులై ఉంటారు. ప్రాపంచిక జనులు, ఇంద్రియ వస్తువిషయముల నుండి వచ్చే సుఖాల కోసం ఏంతో శ్రమిస్తారు, కానీ, అవే నిజముగా దుఃఖ హేతువులు అని తెలుసుకోరు. కానీ, కర్మ యోగులు వాటి యందు ఆసక్తి కలిగి ఉండరు; ప్రతిగా, తమలోనే ఉన్న భగవంతుని ఆనందాన్ని ఆస్వాదిస్తారు.\n\t\t\t    ఈ అధ్యాయం, తదుపరి, కర్మ సన్యాస మార్గాన్ని వివరిస్తుంది. కర్మ సన్యాసులు ఇంద్రియమనోబుద్ధుల నియంత్రణకు ఎన్నో నిష్ఠలు పాటిస్తారు. వారు బాహ్యమైన భోగ సంబంధ అన్ని తలంపులని త్యజించి, కామ, క్రోధ, భయముల నుండి స్వేచ్ఛ పొందుతారు. ఈ నియమనిష్ఠలన్నిటినీ భగవత్ భక్తితో సంపూర్ణము చేసి, శాశ్వతమైన శాంతిని పొందుతారు.",
      verses: chapter5,
    },
    {
      id: 6,
      chapter_number: "6వ అధ్యాయము",
      yogam_name: "ధ్యాన యోగము",
      description:
        "\t\t\tఈ అధ్యాయంలో, శ్రీ కృష్ణుడు, ఐదవ అధ్యాయంలో నుండీ ఉన్న వస్తున్న 'కర్మ యోగ' (ప్రాపంచిక విధులు నిర్వర్తిస్తూనే ఆధ్యాత్మిక అభ్యాసం చేయటం) మరియు 'కర్మ సన్యాస' (సన్యాస ఆశ్రమంలో ఆధ్యాత్మికత అభ్యాసం చేయటం) మార్గాలను పోల్చి, విశ్లేషణను కొనసాగిస్తూనే, మొదటి మార్గాన్నే సిఫారసు చేస్తున్నాడు. మనం కర్మలను భక్తితో చేసినప్పుడు, అది మన మనస్సుని పవిత్రం చేసి మన ఆధ్యాత్మిక విజ్ఞానాన్ని స్థిరపరుస్తుంది. అప్పుడు మనస్సు ప్రశాంతత పొందిన తరువాత, ధ్యానమే, మన ఉన్నతికి ప్రధాన ఉపకరణము అవుతుంది. ధ్యానము ద్వారా యోగులు తమ మనస్సుని జయించటానికి శ్రమిస్తారు, ఎందుకంటే అశిక్షితమైన నిగ్రహింపబడని మనస్సు మన ప్రధాన శత్రువు, కానీ, సుశిక్షితమైన నియంత్రణలో ఉన్న మనస్సు మన మంచి మిత్రుడు. తీవ్రమైన కఠిన నిష్ఠలు పాటించటం ద్వారా ఒక వ్యక్తి ఆధ్యాత్మిక పథంలో పురోగతి సాధించలేడని శ్రీ కృష్ణుడు అర్జునుడిని హెచ్చరిస్తున్నాడు; కాబట్టి తినటంలో, పనిలో, వినోదంలో, మరియు నిద్రలో మిత సంయమనం పాటించాలని ఉపదేశించాడు. తదుపరి, మనస్సుని భగవంతునితో ఏకం (సంయోగం) చేయటానికి 'సాధన' ని వివరిస్తాడు. ఎలాగైతే గాలి వీచని చోట దీపం నిశ్చలంగా ఉంటుందో, అదే విధంగా సాధకుడు మనస్సుని ధ్యానం యందు నిలకడతో ఉంచాలి. నియంత్రణ చేయటానికి మనస్సు నిజానికి చాలా క్లిష్టమైనది, కానీ, అభ్యాసము, వైరాగ్యములతో దీనిని నియంత్రించవచ్చు. కాబట్టి, మనస్సు ఎక్కడికి పోయినా, దానిని తిరిగి తెచ్చి, భగవంతుని వైపే విడువకుండ కేంద్రీకరించాలి. ఎప్పుడైతే మనస్సు పరిశుద్ధమవుతుందో, అది అలౌకిక స్థితిలో నిలుస్తుంది. ఈ యొక్క 'సమాధి' అన్న పరమానంద స్థితి లో వ్యక్తి అనంతమైన దివ్యానందాన్ని అనుభవిస్తాడు.\n\t\t\tఅర్జునుడు తదుపరి శ్రీ కృష్ణుడిని, ఆధ్యాత్మిక మార్గంలో ప్రారంభమై కూడా చంచలమైన మనస్సు వల్ల లక్ష్యాన్ని చేరుకోలేని సాధకుడి గతి ఏమిటి అని ప్రశ్నిస్తాడు. భగవత్ ప్రాప్తి కోసం ప్రయాస పడే వ్యక్తి ఎప్పుడూ చెడిపోడు అని శ్రీ కృష్ణుడు హామీ ఇస్తాడు. భగవంతుడు ఎల్లప్పుడూ మన అన్ని పూర్వ జన్మల ఆధ్యాత్మిక పురోగతి లెక్క చూసుకుని, దానిని మళ్ళీ తదుపరి జన్మలలో పునరుత్తేజింప చేస్తాడు; దీనితో మనం ఎక్కడ విడిచిపెట్టామో అక్కడ నుండి తిరిగి ప్రయాణం మొదలు పెట్టవచ్చు. ఎన్నో జన్మల నుండి పోగైన సాధన ఫలంగా యోగులు ఈ జన్మలోనే భగవంతుడిని చేరుకుంటారు. తపస్వులు (మునులు), జ్ఞానులు (చదువుకున్నవారు, వేద శాస్త్ర పండితులు), మరియు కర్మీల కంటే యోగులే (భగవంతునితో ఏక మవ్వటానికి పరిశ్రమించే వారు) శ్రేష్ఠమైన వారు అని ప్రకటిస్తూ ఈ అధ్యాయం ముగుస్తుంది. ఇంకా, యోగులందరిలో కెల్లా, భగవంతుని పట్ల ప్రేమ యుక్త భక్తిలో నిమగ్నమయ్యే వారే అత్యున్నతమైన వారు.",
      verses: chapter6,
    },
    {
      id: 7,
      chapter_number: "7వ అధ్యాయము",
      yogam_name: "జ్ఞాన విజ్ఞాన యోగము",
      description:
        "\t\t\tభగవంతుని శక్తుల యొక్క భౌతిక మరియు ఆధ్యాత్మిక విస్తారాన్ని వివరించటంతో ఈ అధ్యాయం మొదలౌతుంది. ఇవన్నీ కూడా తన నుండే ఉద్భవించాయని, దారంలో గుచ్చబడిన పూసల వలె తన యందే స్థితమై ఉన్నాయని శ్రీ కృష్ణుడు వివరిస్తున్నాడు. ఆయనే ఈ సమస్త సృష్టికి మూలము, మరియు మళ్ళీ ఇదంతా ఆయనలోకే తిరిగి లయమైపోతుంది. ఆయన యొక్క భౌతిక ప్రాకృతిక శక్తి, మాయ, బలీయమైనది దానిని అధిగమించటం చాలా కష్టము, కానీ, ఆయనకి శరణాగతి చేసినవారు ఆయన కృపకు పాత్రులై, మాయను సునాయాసముగా దాటిపోగలరు. తనకు శరణాగతి చేయని నాలుగు రకాల మనుష్యుల గూర్చి, మరియు తన యందు భక్తిలో నిమగ్నమయ్యే నాలుగు రకాల మనుష్యుల గురించి శ్రీ కృష్ణుడు వివరిస్తాడు. తన భక్తులలో, ఎవరైతే జ్ఞానముతో తనను భజిస్తారో, తమ మనోబుద్ధులను ఆయనతో ఐక్యం చేస్తారో, వారు తనకు అత్యంత ప్రియమైన వారిగా పరిగణిస్తాను అని అంటున్నాడు. తమ బుద్ధి ప్రాపంచిక కోరికలతో కొట్టుకోపోయిన కొందరు, దేవతలకు శరణాగతి చేస్తారు. కానీ, ఈ దేవతలు కేవలం తాత్కాలిక భౌతిక ఫలాలని మాత్రమే ఇవ్వగలరు, వాటిని కూడా తమకు భగవంతుడు ప్రసాదించిన శక్తి ద్వారానే ఇస్తారు. అందుకే, మనం భక్తితో నిమగ్నమవ్వటానికి, భగవంతుడే అత్యంత యోగ్యుడు. సర్వజ్ఞత, సర్వవ్యాపకత్వము మరియు సర్వశక్తిమత్వం వంటి దివ్య గుణములను కలిగి ఉండి, తనే పరమ సత్యమని మరియు అంతిమ లక్ష్యమని, శ్రీ కృష్ణుడు వక్కాణిస్తున్నాడు. కానీ, ఆయన నిజ వ్యక్తిత్వం, తన యోగమాయా శక్తి యొక్క తెరచే కప్పివేయబడి ఉంది, అందుకే తన యొక్క దివ్య మంగళ స్వరూపము యొక్క నిత్య శాశ్వతమైన స్వభావం అందరికీ తెలియదు. ఆయనను మనం ఆశ్రయిస్తే, ఆయనే తన గురించి జ్ఞానాన్ని ప్రసాదిస్తాడు మరియు ఆయనను తెలుసుకున్న తరువాత మనకు కూడా ఆత్మ జ్ఞానము మరియు కర్మ-క్షేత్రము గురించి జ్ఞానం, అవగతమవుతుంది. ",
      verses: chapter7,
    },
    {
      id: 8,
      chapter_number: "8వ అధ్యాయము",
      yogam_name: "అక్షర బ్రహ్మ యోగము",
      description:
        "\t\t\tఉపనిషత్తులలో విస్తారంగా చెప్పబడిన చాలా పదాలని మరియు విషయాలని ఈ అధ్యాయం క్లుప్తంగా వివరిస్తుంది. ఇది మరణం తరువాత ఆత్మ యొక్క గమ్యాన్ని నిర్ణయించే కారకాలను కూడా వివరిస్తుంది. మనం మరణ సమయంలో భగవంతుడిని స్మరించగలిగితే, ఆయనను ఖచ్చితంగా పొందగలము. కాబట్టి, రోజువారి పనులు చేస్తూనే, ఆయనను అన్ని సమయాల్లో స్మరిస్తూనే ఉండాలి. ఆ స్వామి యొక్క గుణములు, లక్షణములు, మరియు మహిమలు గుర్తు చేసుకుంటూ ఆయనను స్మరించవచ్చు. దృఢ సంకల్పముతో యోగ ధ్యానములో మనస్సుని నామ సంకీర్తన ద్వారా ఆయనపైనే కేంద్రీకరించాలి. మన మనస్సుని సంపూర్ణంగా అనన్య భక్తితో ఆయన పైనే నిమగ్నం చేసినప్పుడు మనము ఈ భౌతిక జగత్తుకి అతీతంగా ఆధ్యాత్మిక స్థాయిలోనికి వెళతాము.\n\t\t\t    ఆ తర్వాత, ఈ అధ్యాయం, భౌతిక జగత్తు లోని రకరకాల లోకాల గురించి ప్రస్తావిస్తుంది. సృష్టి క్రమంలో, ఈ లోకాలు మరియు వాటిలో అసంఖ్యాకమైన జీవ రాశులు ఎలా వచ్చాయో, మరలా ప్రళయ కాలంలో ఎలా తిరిగి లయం అవుతాయో, ఈ అధ్యాయం చెపుతుంది. కానీ, ఈ యొక్క వ్యక్త, అవ్యక్త సృష్టికి అతీతంగా, భగవంతుని దివ్య ధామము ఉంటుంది. ప్రకాశవంతమైన మార్గాన్ని అనుసరించినవారు, అంతిమంగా దివ్య ధామాన్ని చేరుకుంటారు, మరియు ఈ మృత్యు లోకానికి తిరిగిరారు; చీకటి మార్గాన్ని అనుసరించేవారు, ఈ జన్మ, వ్యాధి, వృద్దాప్యం, మరియు మృత్యువు యొక్క అంతం లేని చక్రంలో పడి తిరుగుతూనే ఉంటారు.",
      verses: chapter8,
    },
    {
      id: 9,
      chapter_number: "9వ అధ్యాయము",
      yogam_name: "రాజ విద్యా యోగము",
      description:
        "\t\t\tఏడవ మరియు ఎనిమిదవ అధ్యాయాలలో శ్రీ కృష్ణుడు, యోగ ప్రాప్తికి, భక్తియే అన్నింటికన్నా సులువైన మార్గమని, భక్తియే అత్యున్నత యోగ విధానమని ప్రకటించి ఉన్నాడు. తొమ్మిదవ అధ్యాయంలో - విస్మయాన్నీ, పూజ్యభావాన్నీ మరియు భక్తినీ ఉత్పన్నం చేసే - తన యొక్క సర్వోత్కృష్ట మహిమలను గురించి చెప్తున్నాడు. తాను అర్జునుడి ముందు తన సాకార రూపంలో నిలబడి ఉన్నా, తాను ఒక సామాన్య మానవుడినే అని అపోహ పడవద్దని తెలియచేస్తున్నాడు. తాను ఏ విధంగా, తన ఈ యొక్క భౌతిక శక్తిని ఆధీనంలో ఉంచుకొని, సృష్టి ప్రారంభంలో అనేకానేక జీవ రాశులను సృష్టించి, ప్రళయ సమయంలో తిరిగి వాటిని తనలోకే లయం చేసుకుంటాడో మరియు తదుపరి సృష్టి చక్రంలో మరల వాటిని వ్యక్తపరుస్తాడో, వివరిస్తాడు. అంతటా బ్రహ్మాండంగా వీచే గాలి కూడా ఆకాశంలోనే ఎలా స్థితమై ఉంటుందో, అలాగే సమస్త జీవ రాశులూ ఆయన యందే నివసిస్తూ ఉంటాయి. అయినా, తన దివ్య యోగ మాయా శక్తి ద్వారా, ఆయన తటస్థంగా, నిర్లిప్తంగా, ఈ అన్ని కార్యక్రమాలకు కేవలం సాక్షిగా, అన్నీ గమనిస్తూ ఉండిపోతాడు.\n\t\t\t    హిందూ ధర్మంలో ఉన్న ఎంతో మంది దేవుళ్ళ/దేవతల అయోమయాన్ని శ్రీ కృష్ణుడు ఇక్కడ - ఆరాధనా విషయముగా కేవలం ఒకే భగవంతుడు ఉంటాడు - అని వివరించటం ద్వారా పరిష్కరిస్తున్నాడు. ఆయనే లక్ష్యము, ఆధారము, ఆశ్రయము మరియు సర్వ భూతముల నిజమైన స్నేహితుడు. వేదాలలో పేర్కొనబడిన కర్మ కాండల పట్ల ఆసక్తి ఉన్నవారు స్వర్గాది లోకాలను పొందుతారు, మరియు వారి పుణ్య ఫలం క్షయం అయిపోయిన తరువాత తిరిగి భూలోకానికి చేరుకుంటారు. కానీ, ఆ పరమేశ్వరుని పట్ల అనన్య భక్తితో నిమగ్నమై ఉన్నవారు ఆయన పరంధామమునకే చేరుకుంటారు. ఈ విధంగా శ్రీ కృష్ణుడు తన పట్ల ఉండే అనన్య భక్తి యొక్క సర్వోన్నత శ్రేష్ఠతను ఎంతగానో కొనియాడాడు. ఇటువంటి భక్తిలో, మన దగ్గర ఉన్నదంతా ఆయనకే సమర్పించి మరియు ప్రతీదీ ఆయనకోసమే చేస్తూ, మనము భగవంతుని చిత్తముతో సంపూర్ణంగా ఏకమై నివసించాలి. ఇటువంటి స్వచ్ఛమైన పవిత్రమైన భక్తిచే, మనము కర్మ బంధాలనుండి విడిపింపబడి, భగవంతునితో ఆధ్యాత్మిక ఏకత్వం పొందుతాము.\n\t\t\t    ఇంకా, తను ఒకరి పట్ల అనుకూలంగా, మరొకరి పట్ల ప్రతికూలంగా ఉండను అంటున్నాడు - ఆయన సమస్త ప్రాణుల పట్ల నిష్పక్షపాతంగా వ్యవహరిస్తాడు. పరమ పాపిష్ఠి వారు అయినా సరే ఆయనను ఆశ్రయిస్తే, ఆయన వారిని ఆహ్వానించి, స్వీకరించి వారిని శీఘ్రముగా పుణ్యాత్ములుగా, పవిత్రులుగా తీర్చిదిద్దుతాడు. తన భక్తులు ఎన్నటికీ నశింపరు అని ఆయన హామీ ఇస్తున్నాడు. ఆయన వారి యందే స్థితమై ఉండి, వారికి లేనివి సమకూర్చి పెడతాడు, మరియు, వారికి ఉన్నవాటిని సంరక్షిస్తాడు. అందుకే, మనం సర్వదా ఆయనను స్మరించాలి, ఆరాధించాలి, మన మనస్సు-శరీరమును ఆయనకు సమర్పించాలి, ఆయన్నే సర్వోన్నత లక్ష్యంగా చేసుకోవాలి.",
      verses: chapter9,
    },
    {
      id: 10,
      chapter_number: "10వ అధ్యాయము",
      yogam_name: "విభూతి యోగము",
      description:
        "\t\t\tభగవంతుని యొక్క వైభవోపేతమైన మరియు దేదీప్యమానమైన మహిమలను గుర్తుచేసుకుంటూ ఆయనపై ధ్యానం చేయటానికి సహాయముగా అర్జునుడికి ఈ అధ్యాయము శ్రీ కృష్ణుడిచే చెప్పబడినది. తొమ్మిదవ అధ్యాయంలో, శ్రీ కృష్ణుడు భక్తి శాస్త్రాన్ని తెలియపరిచాడు మరియు తన యొక్క కొన్ని వైభవాలని వివరించాడు. ఇక్కడ ఇక, అర్జునుడి భక్తిని మరింత ఇనుమడింపచేయాలని తన అనంతమైన మహిమలని మరింత వివరిస్తున్నాడు శ్రీ కృష్ణుడు. ఈ శ్లోకాలు, చదవటానికి కమనీయంగా మరియు వినటానికి మనోరంజకంగా ఉంటాయి.\n\t\t\tఈ జగత్తులో ఉన్న ప్రతిదానికీ తనే మూలము అని తెలియచెప్తున్నాడు శ్రీ కృష్ణుడు. మానవులలో ఉన్న విభిన్న లక్షణములు ఆయన నుండే ఉద్భవించాయి. సప్తర్షులు, నలుగురు మహాత్ములు మరియు పద్నాలుగు మనువులు ఆయన మనస్సు నుండే జనించారు మరియు వారి నుండే ఈ ప్రపంచంలోని అందరు మనుష్యులూ అవతరించారు. సమస్తమూ ఆయన నుండే ఉద్భవించాయి అన్న విషయం తెలుసుకున్నవారు ఆయన పట్ల భక్తితో దృఢ విశ్వాసంతో నిమగ్నమౌతారు. ఇటువంటి భక్తులు ఆయన మహిమల గురించి చర్చిస్తూ, ఇతరులకు ఆయన గురించి తెలియచేస్తూ ఎంతో తృప్తిని అనుభవిస్తారు. వారి మనస్సులు ఆయనతో ఏకమై పోవటం వలన, వారి హృదయములోనే వసించే భగవంతుడు, వారికి దివ్య జ్ఞానము అనుగ్రహిస్తాడు, దానిచే ఆయనను వారు సునాయాసముగానే పొందుతారు. \n\t\t\tఅర్జునుడు, ఇది విన్న పిదప, శ్రీ కృష్ణుని యొక్క సర్వోన్నత స్థాయిని గురించి తాను సంపూర్ణముగా విశ్వసిస్తున్నానని ప్రకటిస్తాడు; మరియు శ్రీ కృష్ణుడే సర్వోత్కృష్ట పరమేశ్వరుడని చాటిచెప్పాడు. వినటానికి అమృతములా ఉండే ఆయన యొక్క కీర్తి విశేషాలని మరింత చెప్పమని భగవంతుడిని ప్రార్థిస్తాడు. సమస్త పదార్థములకు కృష్ణుడే ఆది, మధ్య, అంతము కావున, ఉన్నదంతా ఆయన యొక్క శక్తి స్వరూపమే అని శ్రీ కృష్ణుడు తెలియచేస్తున్నాడు. సౌందర్యము, యశస్సు, శక్తి, జ్ఞానము, మరియు ఐశ్వర్యములు అనంతమైన పరిమాణంలో కలిగిన భాండాగారము, శ్రీ కృష్ణుడు. ఎప్పుడైనా మనము మహాద్భుతమైన వైభవమును ఎక్కడైనా గమనిస్తే, ఏదైనా మనలను ఆశ్చర్యచకితులను చేస్తే, మనల్ని పారవశ్యములో ముంచి, మనకు పరమానందమును కలుగచేస్తే, అది శ్రీ కృష్ణుడి వైభవోపేతమైన ఐశ్వర్యములో ఒక చిన్న తళుకే అని తెలుసుకోవాలి. సమస్త ప్రాణులు మరియు వస్తువులు తమతమ శక్తిసామర్థ్యాలను ఆయన యొక్క మూలశక్తి భాండాగారము నుండే పొందుతాయి. తదుపరి ఈ అధ్యాయంలో, తన ఐశ్వర్యమును చక్కగా వివరించే వస్తువులు, వ్యక్తిత్వాలు మరియు కార్యకలాపములను వివరిస్తాడు శ్రీ కృష్ణుడు. చివరికి, తన యొక్క ఐశ్వర్యము, వైభవము యొక్క పరిమాణము, కేవలం ఇప్పుడు చెప్పిన దాని యొక్క మొత్తంగా మాత్రమే అనుకోవద్దు అని ఆయన అంటాడు - ఎందుకంటే, అసంఖ్యాకమైన విశ్వములను తన అస్తిత్వంలోని అతి చిన్న భాగంతోనే నిలబెట్టి సంరక్షిస్తుంటాడు, శ్రీ కృష్ణుడు. అందుకే, ఆ సమస్త ఐశ్వర్యమునకు మూలమైన భగవంతుడినే మన ఆరాధనా విషయముగా చేసుకోవాలి.",
      verses: chapter10,
    },
    {
      id: 11,
      chapter_number: "11వ అధ్యాయము",
      yogam_name: "విశ్వ రూప దర్శన యోగము",
      description:
        "\t\t\tఇంతకు క్రితం అధ్యాయంలో, అర్జునుడి భక్తిని మరింత వికసింపచేయటానికి, శ్రీ కృష్ణుడు తన దివ్య విభూతులను వివరించి ఉన్నాడు. సుందరమైనవి, మహాద్భుతమైనవి, మరియు శక్తివంతమైనవి అన్నీ కూడా తన వైభవములోని చిన్న తళుకులే అని చివరికి సూచనప్రాయంగా తన విశ్వ రూపము గురించి ప్రస్తావించాడు. ఈ అధ్యాయంలో, అర్జునుడు శ్రీ కృష్ణుడి విశ్వ రూపమును చూడాలని ప్రార్థిస్తున్నాడు, అది సమస్త బ్రహ్మాండములను తనలోనే కలిగి ఉన్న అనంతమైన విశ్వ రూపము. శ్రీ కృష్ణుడు దానికి ఒప్పుకుని, అతనికి దివ్య దృష్టిని ప్రసాదిస్తాడు. అర్జునుడు అప్పుడు సమస్త సృష్టిని ఆ దేవ దేవుని శరీరము యందే దర్శిస్తాడు. ఆయన అనంతమైన ముఖములను, కళ్ళను, బాహువులను, మరియు ఉదరములను ఆ యొక్క మహాద్భుతమైన మరియు అనంతమైన భగవంతుని రూపంలో దర్శిస్తాడు. ఆ స్వరూపమునకు ఎలాంటి మొదలు లేదా తుది లేదు మరియు అన్ని దిశలయందు అనంతమైన పరిమాణంలో వ్యాపించి ఉంది. ఆ యొక్క విశ్వ రూప తేజస్సు, వెయ్యి సూర్యులు ఒక్క సారిగా ఆకాశములో వెలిగిన కాంతి కంటే తేజోవంతముగా ఉన్నది. ఆ దర్శనం అర్జునుడి వెంట్రుకలను నిక్కబోడుచుకునేలా చేసింది. ముల్లోకాలూ భగవంతుని శాసనానికి భయంతో వణకటం గమనిస్తాడు. దేవతలు ఆయన యందే ఆశ్రయం పొంది ఉండటం మరియు మహర్షులు శ్లోకాలు, కీర్తనలతో ఆయనను స్తుతించటం ప్రత్యక్షంగా చూస్తాడు. పురుగులు మంటలోనికి వేగంగా వెళ్ళి పడిపోయి భస్మమైపోతునట్టు, ధృతరాష్ట్రుడి కుమారులందరూ, వారి అనుబంధ రాజులతో సహా, ఆ భయంకర స్వరూపము నోటిలోనికి దూసుకెళ్లటం చూస్తాడు. ఆ విశ్వ రూపమును దర్శించటంతో గుండె భయంతో దడదడలాడి పోతున్నదని, మానసిక ప్రశాంతత పోయినదని ఒప్పుకుంటాడు. అర్జునుడు భీతిల్లిపోయి, ఈ మహోన్నత ప్రభువు నిజానికి ఎవరు అని తెసుకోవాలనుకుంటాడు, ఎందుకంటే ఈ రూపానికీ మరియు తనకు తెలిసిన గురువు మరియు సఖుడైన కృష్ణునికి ఏమాత్రం పోలిక లేదు. శ్రీ కృష్ణుడు దీనికి సమాధానముగా, తానే కాల రూపములో ముల్లోకాలను నాశనం చేసేవాడను అని చెప్తాడు. కౌరవ మహాయోధులందరూ తనచే పూర్వమే సంహరింపబడ్డారు కాబట్టి, విజయం నిశ్చితమైనది కావున, అర్జునుడు ఇక లేచి యుద్ధం చేయాలని అంటాడు.\n\t\t\t    దీనికి ప్రతిస్పందనగా, అర్జునుడు, శ్రీకృష్ణుడిని అనంతమైన శక్తి సామర్థ్యములు కలిగిన ఈశ్వరునిగా స్తుతించి ఆయనకు పదేపదే నమస్కరిస్తాడు. తమ సుదీర్ఘ మైత్రిలో తను ఎప్పుడైనా కృష్ణుడిని సామాన్య మానవునిగా పొరపాటుగా అనుకుని ఆయన మనస్సు నొప్పించేట్టు ఏదైనా తప్పు చేస్తే క్షమించమని అడుగుతాడు. కృప కోసం ప్రార్థించి మరొక్కసారి తిరిగి మనోహరమైన భగవంతుని మామూలు రూపాన్ని చూపమని అడుగుతాడు. శ్రీ కృష్ణుడు అతని కోరికను మన్నించి మొదట చతుర్భుజ రూపమునకు వచ్చి, తదుపరి, తన సుకుమారమైన మరియు రమ్యమైన రెండు-భుజముల స్వరూపములోనికి వస్తాడు. అర్జునుడు ఏ విధమైన భగవత్ స్వరూపాన్ని దర్శనం చేసాడో ఆ దర్శనం లభించటం ఎంత దుర్లభమో అర్జునుడికి చెప్తాడు. వేదములు అభ్యసించటం వలన, తపస్సులు ఆచరించటం చేత, దానధర్మాల చేత, లేదా యజ్ఞములు చేయటం ద్వారా కానీ ఆయన నిజ స్వరూపమును దర్శించలేము. నిష్కల్మషమైన భక్తిచే మాత్రమే ఆయనను అర్జునుడు ఎదుటే ఉన్నవాడిలా, నిజరూపములో తెలుసుకోగలము, మరియు ఆయనతో ఏకమవ్వగలము.",
      verses: chapter11,
    },
    {
      id: 12,
      chapter_number: "12వ అధ్యాయము",
      yogam_name: "భక్తి యోగము",
      description:
        "\t\t\tఈ చిన్న అధ్యాయము, మిగతా అన్ని ఆధ్యాత్మిక మార్గముల కన్నా, ప్రేమ యుక్త భక్తి మార్గము యొక్క సర్వోన్నత ఉత్కృష్టతని నొక్కివక్కాణిస్తుంది. యోగములో ఎవరిని ఎక్కువ శ్రేష్ఠులుగా కృష్ణుడు పరిగణిస్తాడు అని అర్జునుడు అడగటంతో ఈ అధ్యాయము ప్రారంభమవుతుంది —భగవంతుని సాకార రూపము పట్ల భక్తితో ఉండేవారా లేక నిరాకార బ్రహ్మంను ఉపాసించే వారా అని. ఈ రెండు మార్గాలు కూడా భగవత్ ప్రాప్తికే దారితీస్తాయి అని శ్రీ కృష్ణుడు సమాధానమిస్తాడు. కానీ, తన సాకార రూపమును ఆరాధించేవారే అత్యుత్తమ యోగులని ఆయన భావిస్తాడు. నిరాకార, అవ్యక్త భగవత్ తత్త్వముపై ధ్యానం చేయటం చాలా ఇబ్బందులతో కూడి ఉన్నది మరియు అది బద్ద జీవులకు చాలా కష్టతరమైనది అని వివరిస్తాడు. తమ అంతఃకరణ ఆయనతో ఏకమై పోయినవారు, మరియు తమ అన్ని కార్యములను ఆయనకే అర్పించిన సాకార రూప భక్తులు, త్వరితగతిన జనన-మరణ చక్రము నుండి విముక్తి చేయబడతారు. శ్రీ కృష్ణుడు ఈ విధంగా అర్జునుడిని, అతని బుద్ధిని తనకు అర్పించి, మనస్సుని అనన్య ప్రేమ-యుక్త భక్తితో తన యందే లగ్నం చేయమని ప్రార్థిస్తాడు.\n\t\t\t    కానీ, తరచుగా, ఇటువంటి ప్రేమ, ప్రయాసపడే జీవాత్మలో కనిపించదు. కాబట్టి, శ్రీకృష్ణుడు ఇతర పద్ధతులను కూడా సూచించాడు, ఒకవేళ అర్జునుడు తక్షణమే భగవంతుని యందు మనస్సుని పూర్తిగా నిమగ్నం చేసే స్థాయిని చేరుకోలేకపోతే, అతను ఆ యొక్క దోషరహిత పరిపూర్ణ స్థాయిని చేరుకోవటానికి పరిశ్రమించాలి. భక్తి అనేది ఏదో ఒక నిగూఢమైన బహుమానం కాదు, దానిని నిరంతర అభ్యాసము ద్వారా పెంపొందించుకోవచ్చు. ఒకవేళ అర్జునుడు ఇది కూడా చేయలేకపోతే, అతను ఓటమిని ఒప్పుకోకూడదు; సరికదా భక్తితో శ్రీకృష్ణుడి ప్రీతికోసం పనిచేయటం నేర్చుకోవాలి. ఒకవేళ ఇది కూడా సాధ్యం కాకపోతే, అతను తన కర్మ-ఫలములను త్యజింఛాలి మరియు ఆత్మయందే స్థితమై ఉండాలి. కృష్ణుడు ఇంకా ఏమంటున్నాడంటే, యాంత్రికమైన అభ్యాసం కన్నా జ్ఞానాన్ని పెంపొందించుకోవటం ఉన్నతమైనది, జ్ఞానాన్ని పెంపొందించుకోవడం కంటే ధ్యానం ఉన్నతమైనది; ధ్యానం కంటే ఉన్నతమైనది కర్మ ఫలములను త్యజించటం, ఇది తక్షణమే ఎంతో శాంతిని కలుగజేస్తుంది. ఈ అధ్యాయం యొక్క మిగతా శ్లోకాలు భగవంతుడికి చాలా ప్రియమైన, ఆయన ప్రేమ-యుక్త భక్తుల యొక్క మహోన్నతమైన గుణములను విశదీకరిస్తాయి.",
      verses: chapter12,
    },
    {
      id: 13,
      chapter_number: "13వ అధ్యాయము",
      yogam_name: "క్షేత్ర క్షేత్రజ్ఞ విభాగ యోగము",
      description:
        "\t\t\tఒక్కోటి ఆరు అధ్యాయములతో కూడిన మూడు విభాగాలుగా, భగవద్గీతలో మొత్తం పద్దెనిమిది అధ్యాయాలు ఉంటాయి. మొదటి ఆరు అధ్యాయముల భాగము కర్మ యోగాన్ని విశదీకరిస్తుంది. రెండవ భాగము, భక్తి యొక్క మహత్వమును, మరియు భక్తిని పెంపొందించుకోవటానికి భగవంతుని యొక్క విభూతులను కూడా (ఐశ్వర్యములను) తెలియపరుస్తుంది. మిగతా ఆరు అధ్యాయముల మూడవ భాగము, తత్త్వ జ్ఞానమునకు అర్థవివరణ చేస్తుంది. ఈ ప్రస్తుత అధ్యాయము, మూడవ భాగములోని మొదటి అధ్యాయము; ఇది రెండు పదాలను మనకు పరిచయం చేస్తున్నది — క్షేత్రము మరియు క్షేత్రజ్ఞుడు (క్షేత్రమును తెలిసినవాడు). క్షేత్రము అంటే ఈ శరీరము అని మరియు క్షేత్రజ్ఞుడు (క్షేత్రమును ఎరిగినవాడు) అంటే అందులో ఉండే ఆత్మ అని అనుకోవచ్చు. కానీ ఇది విషయాన్ని చాలా సరళీకరణం చేసినట్టే, ఎందుకంటే క్షేత్రము అంటే దానిలో చాలా ఉంటాయి — మనస్సు, బుద్ధి, మరియు అహంకారము, మరియు మన వ్యక్తిత్వములో ఉండే భౌతిక శక్తి యొక్క అన్ని అంశములు. ఈ బృహత్‌ నిర్వచనంలో, ఆత్మ తప్ప, మన వ్యక్తిత్వమును నిర్ణయించే మిగతా అన్ని అస్తిత్వాలను కలిపి శరీర క్షేత్రము అనవచ్చు. జీవాత్మను క్షేత్రమును తెలిసినవాడు, లేదా 'క్షేత్రజ్ఞుడు' అంటారు.\n\t\t\t    ఎలాగైతే, ఒక రైతు తన క్షేత్రములో విత్తనములు వేసి, దాని నుండి పంటను పొందుతాడో, అదేవిధంగా మన శరీరము అనే క్షేత్రములో మంచి లేదా చెడు తలంపులు మరియు కార్యములు వేసి, తద్వారా మన భవిష్యత్తుని పొందుతాము. బుద్ధుడు ఇలా వివరించాడు: ‘మన ప్రస్తుత స్థితి మన ఆలోచనల/తలంపుల ఫలితమే; అది మన తలంపుల మీదనే ఆధారపడి ఉన్నది; మరియు అది మన ఆలోచనలతోనే తయారు చేయబడినది.’ కాబట్టి, మన ఆలోచనలు ఎట్లా ఉంటే మనం అట్లానే అవుతాము. ప్రఖ్యాత అమెరికన్ తత్త్వవిచారకుడు రాల్ఫ్ వాల్డో ఎమెర్సన్, ఇలా అన్నాడు: ‘ప్రతి పని యొక్క వెనుక మూలకారణం ఒక ఆలోచన ఉంటుంది. (The ancestor of every action is thought).’ అందుకే, మన క్షేత్రమును, మంచి ఆలోచనలు మరియు చర్యలతో ఉంచుకునే కళను మనం నేర్చుకోవాలి. దీనికి క్షేత్రము మరియు క్షేత్రజ్ఞుడు – యొక్క తేడాను స్పష్టంగా చూపించే జ్ఞానం అవసరము. ఈ ప్రస్తుత అధ్యాయములో, శ్రీ కృష్ణుడు ఈ యొక్క విషయంపై విస్తారమైన విశ్లేషణను అందిస్తున్నాడు. శరీర క్షేత్రములో ఉన్న భౌతిక ప్రాకృతిక మూలకాలన్నింటినీ ఇక్కడ పేర్కొంటున్నాడు. భావాలు, ఉద్వేగాలు, మరియు మానసిక స్థితుల రూపాల్లో, క్షేత్రములో జనించే మార్పులు/కదలికలను ఆయన వివరిస్తాడు. క్షేత్రమును పవిత్రం చేసి, దానిని జ్ఞాన దీపముచే ప్రకాశం చేసే గుణములు మరియు లక్షణములను శ్రీ కృష్ణుడు పేర్కొంటాడు. ఇటువంటి జ్ఞానము మనకు క్షేత్రజ్ఞుడైన ఆత్మను అనుభవము లోనికి తేవటానికి దోహదపడుతుంది. ఆ తదుపరి, ఈ అధ్యాయము, సమస్త ప్రాణుల క్షేత్రములను సంపూర్ణముగా తెలిసినవాడైన భగవంతుడి గురించి మనకు వివరిస్తుంది. ఆ సర్వోన్నత భగవానుడు ఒకేసమయంలో పరస్పర విరుద్ధమైన లక్షణములను కలిగి ఉంటాడు, అంటే, ఒకే సమయంలో విరుద్ధమైన గుణములను కలిగి ఉండటం. అందుకే, సృష్టిలో సర్వవ్యాపిగా ఉంటాడు, మరియు సర్వ భూతముల హృదయములలో కూర్చుని కూడా ఉంటాడు. కాబట్టి, అందుకే ఆయన సమస్త ప్రాణులకు పరమాత్మ.\n\t\t\t    ఆత్మ, పరమాత్మ, మరియు భౌతిక ప్రకృతి-లను వివరించిన పిదప, శ్రీ కృష్ణుడు, జీవ రాశులు చేసే పనులకు వీటిలో ఏది కారణమో వివరిస్తాడు, మరియు అంతేకాక, స్థూలంగా ఈ ప్రపంచంలో కారణము మరియు కార్యములకు ఏది మూలమో కూడా వివరిస్తాడు. ఎవరైతే వీటిని స్పష్టంగా వేర్వేరుగా చూడగలుగుతారో మరియు సరిగ్గా నిశితంగా కార్యము యొక్క కారణములను చూడగలరో, వారే నిజముగా చూసినట్టు; వారే నిజముగా జ్ఞానములో స్థితమై ఉన్నట్టు. వారు ప్రతి ప్రాణిలో ఉన్న పరమాత్మను గమనించగలరు, మరియు తమ మనస్సుచే తమని తామే నీచ స్థాయికి దిగజార్చుకోరు. విభిన్నమైన జీవరాశులు ఒకే ప్రకృతి యందు స్థితమై ఉన్నట్టు చూడగలరు. సమస్త సృష్టిలో అంతర్లీనంగా వ్యాప్తమై ఉన్న ఒకే ఒక ఆధ్యాత్మిక అస్తిత్వమును చూడగలిగిన తరుణంలో వారు బ్రహ్మ జ్ఞానమును పొందుతారు.",
      verses: chapter13,
    },
    {
      id: 14,
      chapter_number: "14వ అధ్యాయము",
      yogam_name: "గుణత్రయ విభాగ యోగము",
      description:
        "\t\t\tగత అధ్యాయము, ఆత్మ మరియు భౌతిక శరీరమునకు మధ్య తేడాని విపులంగా విశదీకరించింది. ఈ అధ్యాయము, దేహము మరియు దాని మూలకముల యొక్క మూలశక్తి అయిన భౌతిక శక్తి యొక్క స్వభావమును వివరిస్తుంది; ఇదే మనస్సు మరియు పదార్థమునకు మూలము. భౌతిక ప్రకృతి మూడుగుణములతో కూడి ఉంటుంది అని శ్రీ కృష్ణుడు వివరిస్తున్నాడు - సత్త్వము, రజస్సు, మరియు తమస్సు. భౌతిక శక్తిచే తయారైన శరీరమనోబుద్ధులు కూడా ఈ మూడు గుణములను కలిగి ఉంటాయి; ఈ మూడు గుణముల కలయిక మనలో ఏ పాళ్ళలో ఉన్నది అన్నదాని బట్టి మన వ్యక్తిత్వము ఆధారపడి ఉంటుంది. సత్త్వ గుణము - శాంతి, సదాచారము, సద్గుణము మరియు ప్రసన్నత వంటి లక్షణాలతో ఉంటుంది. రజో గుణము వలన అంతులేని కోరికలు మరియు ప్రాపంచిక అభ్యున్నతి కోసం తృప్తినొందని తృష్ణ, కలుగుతాయి. మరియు తమో గుణము వలన భ్రమ, సోమరితనం, మత్తు మరియు నిద్ర కలుగుతాయి. ఆత్మ, జ్ఞానోదయం పొందేవరకూ, ప్రకృతి యొక్క ఈ బలీయమైన శక్తులతో వ్యవహరించటం నేర్చుకోవాలి. ఈ త్రి-గుణములకు అతీతముగా వెళ్ళటమే మోక్షము.\n\t\t\t    ఈ త్రి-గుణముల బంధనమును ఛేదించి వెళ్లిపోవటానికి ఒక సరళమైన ఉపాయం తెలియచేస్తాడు శ్రీ కృష్ణుడు. సర్వోత్కృష్ట భగవానుడు ఈ మూడు గుణములకు అతీతుడు, ఒకవేళ మనం ఆయనతో అనుసంధానం అయిపోతే, ఆ తదుపరి, మన మనస్సు కూడా దివ్యమైన స్థాయికి ఎదుగుతుంది. ఈ తరుణంలో, అర్జునుడు, త్రిగుణములకు అతీతముగా ఎదిగిన వారి లక్షణములు ఏమిటి అని అడుగుతాడు. అటువంటి జీవన్ముక్తులైన వారి లక్షణములను శ్రీ కృష్ణుడు క్రమపద్ధతిలో వివరిస్తాడు. జ్ఞానోదయమైన వారు ఎల్లప్పుడూ సమత్వచిత్తము (సమతౌల్యం) తోనే ఉంటారు అని చెప్తాడు; జగత్తులో ఈ త్రిగుణములు ప్రవర్తిల్లుచున్నప్పుడు, వాటి ప్రభావం మనుష్యులలో, వస్తువులలో, పరిస్థితులలో వ్యక్తమైనప్పుడు వారు ఉద్వేగానికి లోనుకారు. వారు అన్నింటినీ భగవంతుని యొక్క శక్తి ప్రకటితమవుతున్నట్టుగానే చూస్తారు; అన్నీ చివరికి ఆయన అధీనములోనే ఉన్నట్టు గమనిస్తారు. అందుకే, ప్రాపంచిక పరిస్థితులు వారిని అతిసంతోషానికి లేదా దుఃఖమునకు గురి చేయవు; చలించిపోకుండా ఉండి వారు ఆత్మ యందే స్థితమై ఉంటారు. త్రిగుణములకు అతీతముగా ఎదగటానికి, భక్తి యొక్క ఔన్నత్యాన్ని, శక్తిని మరల ఒకసారి మనకు శ్రీ కృష్ణ పరమాత్మ గుర్తు చేయటంతో ఈ అధ్యాయం ముగుస్తుంది. ",
      verses: chapter14,
    },
    {
      id: 15,
      chapter_number: "15వ అధ్యాయము",
      yogam_name: "పురుషోత్తమ యోగము",
      description:
        "\t\t\tఇంతకు క్రితం అధ్యాయములో, ప్రకృతి త్రిగుణములకు అతీతులమవటం ద్వారా భగవత్ లక్ష్యమును చేరుకోవచ్చు అని శ్రీ కృష్ణుడు వివరించి ఉన్నాడు. అనన్య భక్తిలో నిమగ్నమవటమే త్రి-గుణములకు అతీతులమై పోవటానికి ఉన్న అద్భుతమైన పద్ధతి అని కూడా చెప్పి ఉన్నాడు. ఇటువంటి భక్తిలో నిమగ్నమవటానికి, మనము మనస్సుని ఈ ప్రపంచం నుండి దూరం చేసి దానిని భగవంతుని యందే నిమగ్నం చేయాలి. అందుకే, ఈ ప్రపంచం యొక్క స్వభావాన్ని తెలుసుకోవటం చాలా ఆవశ్యకం.\n\t\t\tఈ అధ్యాయంలో, అర్జునుడికి భౌతిక జగత్తు పట్ల వైరాగ్యం పెంపొందించటానికి సహాయం చేయటానికి, శ్రీ కృష్ణుడు, ఈ యొక్క భౌతిక జగత్తుని తద్రూప ఉపమానముతో వివరిస్తున్నాడు. భౌతిక జగత్తుని ఒక తల క్రిందులుగా ఉండే అశ్వత్థ వృక్షం (రావిచెట్టు) తో పోల్చుతున్నాడు. బద్ధ జీవాత్మ - ఆ వృక్షం ఎక్కడి నుండి వచ్చినదో, ఎప్పటినుండి ఇది ఉందో, అది ఎట్లా పెరుగుతూనే ఉంటుందో తెలుసుకోకుండానే - ఒక జన్మ నుండి ఇంకో జన్మకు ఆ చెట్టు కొమ్మలలో పైకీ క్రిందికీ తిరుగుతూనే ఉంటుంది. ఆ చెట్టు యొక్క వేర్లు పైకి ఉంటాయి, ఎందుకంటే దాని యొక్క మూలం భగవంతునిలో ఉంది కాబట్టి. వేదములలో చెప్పబడిన కామ్య కర్మలు ఆ చెట్టుకి ఆకులలాంటివి. ఆ చెట్టుకి పోషణ, ప్రకృతి యొక్క త్రి-గుణములు. ఈ గుణములు ఇంద్రియ విషయములను సృష్టిస్తాయి, అవి ఈ చెట్టుకు అంకురముల (మొగ్గ) వంటివి. ఈ అంకురములు, ఊడలను (aerial roots) ని జనింపచేస్తాయి. అవి వృక్షమును మరింత విస్తరింపచేస్తాయి. ఈ అధ్యాయము, ఈ ఉపమానం ఆధారంగా - భౌతిక ప్రపంచంలో క్లేశములకు గురయ్యే జీవాత్మ, భౌతిక అస్తిత్వములో ఉండే జగత్తు యొక్క నిజ స్వరూపము యొక్క అజ్ఞానము వలన, మరింత దానిలో ఎలా చిక్కుకుని పోతుందో - విస్తారముగా వివరిస్తుంది. వైరాగ్యము అనే గొడ్డలి సహాయంతో ఈ వృక్షాన్ని కొట్టివేయాలి అని శ్రీ కృష్ణుడు చెప్తున్నాడు. ఆ తరువాత మనం ఆ చెట్టు యొక్క మూలం కోసం వెతకాలి; అది స్వయంగా భగవంతుడే. ఆ మూలాన్ని తెలుసుకున్న పిదప ఆయనకి ఈ అధ్యాయములో చెప్పబడిన విధముగా శరణాగతి చేయాలి; అప్పుడు మనము ఆ భగవంతుని యొక్క దివ్య ధామముని చేరుకుంటాము, ఆ తదుపరి మళ్ళీ ఇక ఈ భౌతిక జగత్తులోకి రాము.\n\t\t\t    శ్రీ కృష్ణుడు ఇక తదుపరి, తనయొక్క నిత్య సనాతనమైన అంశములైన, ఈ జగత్తులో ఉన్న జీవాత్మలు, దివ్యమైనవని వివరిస్తున్నాడు. కానీ, భౌతిక ప్రకృతి చే బద్ధులైపోయి, మనస్సుతో కలిపి ఆరు ఇంద్రియములచే అవి కష్టాలను అనుభవిస్తున్నాయి. జీవాత్మ దివ్యమైనది అయినా, అది ఎలా ఇంద్రియముల యొక్క భౌతిక విషయములను భోగిస్తూ ఉంటుందో వివరిస్తున్నాడు. ఆత్మ మరణ సమయంలో ఇంకొక శరీరములోనికి, తన ప్రస్తుత జన్మ యొక్క మనస్సు మరియు ఇంద్రియములతో సహా, ఎలా ప్రవేశిస్తుందో వివరిస్తాడు. అజ్ఞానులు తమ దేహములోని ఆత్మను గుర్తించరు; మరియు అది మరణ సమయంలో వెళ్లిపోవటాన్ని కూడా గుర్తించరు. కానీ యోగులు తమ యొక్క జ్ఞాన-చక్షువులచే మరియు పవిత్రమైన మనస్సుచే దానిని గ్రహిస్తారు. అదే విధంగా భగవంతుడు కూడా తన సృష్టిలో అంతటా ఉంటాడు; కానీ ఆయనను జ్ఞాన చక్షువులచే తెలుసుకోవాలి. అంతటా వ్యక్తమయ్యే ఆయన యొక్క విభూతుల ద్వారా జగత్తులో భగవంతుని యొక్క అస్తిత్వమును మనము ఎలా తెలుసుకోవచ్చో శ్రీ కృష్ణుడు తెలియచేస్తాడు. క్షరము, అక్షరము మరియు పురుషోత్తమ అనే పదముల వివరణతో ఈ అధ్యాయం ముగుస్తుంది. 'క్షరము' అంటే భౌతిక జగత్తులోని నశించిపోయే జీవరాశులు. 'అక్షరము' అంటే భగవంతుని దివ్య ధామములో ఉన్న విముక్తి పొందిన జీవులు. 'పురుషోత్తమ' అంటే సర్వోత్కృష్ట భగవానుడు, ఆయనే మార్పులేని నియామకుడు మరియు పోషకుడు. ఆయన క్షర మరియు అక్షర జీవులకు అతీతుడు. ఆయన మనసారా ఆరాధించబడాలి.",
      verses: chapter15,
    },
    {
      id: 16,
      chapter_number: "16వ అధ్యాయము",
      yogam_name: "దైవాసుర సంపద్విభాగ యోగము",
      description:
        "\t\t\tఈ అధ్యాయములో, శ్రీ కృష్ణుడు, మనుష్యులలో ఉండే రెండు రకాల స్వభావాలను వివరిస్తున్నాడు - దైవీ గుణాలు మరియు ఆసురీ గుణాలు. శాస్త్ర ఉపదేశాలను/నియమాలను పాటించటం, సత్త్వ గుణమును పెంపొందించుకోవటం, మరియు మనస్సుని ఆధ్యాత్మిక సాధనచే శుద్ధి చేసుకోవటం ద్వారా, దైవీ గుణాలు వృద్ధి చెందుతాయి. అది దైవీ సంపత్తి (దేవుని వంటి గుణములు) పెంచుకోవటానికి దోహదపడుతుంది, చిట్ట చివరగా అది భగవత్-ప్రాప్తిని కలిగిస్తుంది. దీనికి విరుద్ధంగా, ఆసురీ ప్రవృత్తి కూడా ఉంది, రజో గుణము, తమో గుణములతో అనుసంధానం వలన మరియు భౌతిక ప్రాపంచిక దృక్పథాన్ని అవలంబించటం వలన అది పెరుగుతుంది. అది మనిషి యొక్క వ్యక్తిత్వములో అపవిత్ర నడవడికను కలిగిస్తుంది, మరియు అంతిమంగా ఆత్మను నరకం వంటి స్థితిలోకి నెట్టివేస్తుంది.\n\t\t\tఈ అధ్యాయం, దివ్య స్వభావము కలిగి ఉన్న వారి యొక్క దైవీ గుణములను వివరించటంతో ప్రారంభమవుతుంది. ఆ తదుపరి, జాగురూకతతో విడిచిపెట్టవలసిన ఆసురీ (రాక్షస) గుణములను వివరిస్తుంది ఎందుకంటే, అవి మన ఆత్మను మరింత అజ్ఞానములోకి మరియు జనన-మరణ సంసారములోనికి నెట్టివేస్తాయి. శ్రీ కృష్ణుడు ఈ అధ్యాయాన్ని ముగిస్తూ - మన ఏం చేయాలి ఏం చేయకూడదు అన్న విషయం పై శాస్త్రములు చెప్పినవే ప్రమాణములు - అని అంటున్నాడు. శాస్త్ర ఉపదేశాలను మనం అర్థం చేసుకోవాలి మరియు ఆ తరువాతే, ఆ చెప్పబడిన విధంగా ఈ ప్రపంచంలో ప్రవర్తించాలి.",
      verses: chapter16,
    },
    {
      id: 17,
      chapter_number: "17వ అధ్యాయము",
      yogam_name: "శ్రద్ధా త్రయ విభాగ యోగము",
      description:
        "\t\t\tపదునాలుగవ అధ్యాయములో, శ్రీ కృష్ణుడు భౌతిక ప్రకృతి యొక్క త్రిగుణములను వివరించి ఉన్నాడు మరియు అవి మనుష్యులను ఏవిధంగా ప్రభావితం చేస్తాయో కూడా చెప్పాడు. ఈ పదిహేడవ అధ్యాయములో, ఈ త్రిగుణముల యొక్క ప్రభావము గురించి మరింత విస్తారముగా వివరిస్తున్నాడు. మొదటిగా, విశ్వాసము/శ్రద్ధ అనే విషయం గురించి వివరిస్తూ, ఎవ్వరూ కూడా విశ్వాస రహితముగా ఉండరు అని చెప్తున్నాడు, ఎందుకంటే అది మానవ నైజం యొక్క విడదీయలేని భాగము. కానీ, వారివారి మనస్తత్వం బట్టి, జనుల యొక్క విశ్వాసము (faith) అనేది, సాత్త్విక, రాజసిక, లేదా తామసిక రంగును కలిగిఉంటుంది. వారికి ఏ రకమైన విశ్వాసము ఉంటుందో వారి జీవితం కూడా ఆ రకంగానే ఉంటుంది. జనులకు ఆహారం పట్ల కూడా వారివారి గుణములకు అనుగుణంగానే మక్కువ ఉంటుంది. శ్రీ కృష్ణుడు ఆహారాన్ని మూడు రకాలుగా వర్గీకరిస్తూ, మనపై వీటి యొక్క ప్రభావాన్ని వివరిస్తున్నాడు. ఆ తరువాత, కృష్ణుడు యజ్ఞముల గురించి చెప్తూ, ఈ మూడు ప్రకృతి త్రిగుణములలో, యజ్ఞములు వేర్వేరు రకాలుగా ఏ విధంగా ఉంటాయో వివరిస్తాడు. ఆ తర్వాత ఈ అధ్యాయము 'తపస్సు' అనే విషయం వైపు వెళుతుంది మరియు శరీర తపస్సు, వాక్ తపస్సు మరియు మనోతపస్సు లను వివరిస్తుంది. ఈ మూడు తపస్సులు సత్త్వ-రజ-తమో గుణములచే ప్రభావితం అయినప్పుడు అవి వేర్వేరు స్వరూపములలో మారతాయి. ఆ తరువాత 'దానము' అనే విషయం చర్చించబడుతుంది, మరియు దాని యొక్క మూడు రకాల విభాగములు వివరించబడుతాయి.\n\t\t\tచివరగా, శ్రీ కృష్ణుడు త్రి-గుణములకు అతీతముగా వెళ్లి, ‘ఓం తత్ సత్’ అన్న పదముల యొక్క ప్రాముఖ్యత మరియు అర్థమును వివరిస్తాడు; ఇది పరమ సత్యము యొక్క విభిన్న అస్తిత్వములను సూచిస్తుంది. ‘ఓం’ అంటే, ఈశ్వరుని నిరాకార తత్త్వమును సూచిస్తుంది; ‘తత్’ అంటే, పరమేశ్వరుని కొరకు చేసే కార్యములు మరియు కర్మ-కాండలను పవిత్రం చేయటానికి ఉచ్చరించబడుతుంది. ‘సత్’ అంటే, నిత్య సనాతన శుభకరము మరియు మంగళము. ఈ మూడు కలిపి అన్నప్పుడు ఒక అలౌకిక సర్వోత్కృష్టతను కలిగిస్తాయి. శాస్త్ర నియమాలను పట్టించుకోకుండా చేయబడే యజ్ఞము, తపస్సు మరియు దానముల యొక్క నిరర్థకతని వివరిస్తూ ఈ అధ్యాయం ముగుస్తుంది.",
      verses: chapter17,
    },
    {
      id: 18,
      chapter_number: "18వ అధ్యాయము",
      yogam_name: "మోక్ష సన్యాస యోగము",
      description:
        "\t\t\tఈ భగవద్గీత యొక్క ఈ చిట్టచివరి అధ్యాయము మిగతా అన్ని అధ్యాయాల కన్నా దీర్ఘమైనది మరియు ఇది చాలా విషయములను వివరిస్తుంది. అర్జునుడు సన్యాసము అనే విషయాన్ని ప్రారంభిస్తూ, సంస్కృతంలో సాధారణంగా వాడే పదాలైన ‘సన్యాసము’ (కర్మలను త్యజించటం) మరియు ‘త్యాగము’ (కోరికలను త్యజించటం) అన్న వాటి గురించి ఒక ప్రశ్న అడుగుతాడు. ఈ రెండు పదాలు ‘త్యజించటం’  అన్న అర్థం లో ఉన్న మూల పదముల నుండే జనించాయి. ‘సన్యాసి’ అంటే గృహస్తు జీవితంలో పాలుపంచుకోకుండా సాధన కోసము సమాజము నుండి తనను తాను ఉపసంహరించుకుంటాడు. ‘త్యాగి’ అంటే కార్యకలాపాలు చేస్తుంటాడు కానీ, కర్మ ఫలములను అనుభవించాలనే స్వార్థ చింతనను విడిచిపెట్టినవాడు. (భగవద్గీతలో చెప్పబడిన అర్థం ఇది). శ్రీ కృష్ణుడు రెండవ రకం సన్యాసాన్ని సిఫారసు చేస్తున్నాడు. యజ్ఞము, దానము, తపస్సు, మరియు ఇతర ధార్మిక కర్తవ్య కార్యములను ఎప్పుడూ త్యజించకూడదు అంటున్నాడు, ఎందుకంటే అవి జ్ఞానోదయులను కూడా పవిత్రం చేస్తాయి. వాటి పట్ల ఫలాసక్తి లేకుండా, అవి చేయబడాలి కాబట్టి వాటిని మన కర్తవ్యంలా భావించి చేయాలి.\n\t\t\t    తదుపరి, శ్రీ కృష్ణుడు కర్మను ప్రేరేపించే మూడు విషయముల గురించి, కర్మ యొక్క మూడు అంగముల గురించి, కర్మ ఫలములను నిర్ణయించే ఐదు విషయముల గురించి విస్తారమైన విశ్లేషణ అందచేస్తాడు. వీటన్నిటిని త్రిగుణముల పరంగా వివరిస్తాడు. అపరిపూర్ణ జ్ఞానము కలవారు, వారే తమ కర్మల (కార్యముల) కారణము (చేస్తున్నది) అని భావిస్తారు. కానీ జ్ఞానోదయమైన మహాత్ములు, అంతఃకరణ శుద్ధి కలవారై, చేసేది తాముకాదు మరియు ఆ కర్మఫలముకు భోక్త తాము కాదు అని తెలుసుకుంటారు. సతతమూ తమ కర్మ ఫలముల పట్ల అనాసక్తతతో ఉంటూ, వారు కర్మ బంధములలో చిక్కుకోరు. జనులు తమ ఉద్దేశ్యాలు, కార్యకలాపాలలో ఎందుకు విభిన్నరకాలుగా ఉంటారో ఈ అధ్యాయం తదుపరి వివరిస్తుంది. భౌతిక ప్రకృతి యొక్క త్రిగుణముల ప్రకారంగా - వివిధ రకాల జ్ఞానములను, వివిధ రకాల పనులను, మరియు అవి చేసే వారి వివిధ రకాల స్వభావములను ఈ అధ్యాయం వివరిస్తుంది. అదే విశ్లేషణను - బుద్ధి, సంకల్పము, మరియు ఆనందము - పట్ల కూడా ఈ అధ్యాయం అందిస్తుంది. తదుపరి ఈ అధ్యాయము, ఆధ్యాత్మిక జీవనంలో పరిపూర్ణ సిద్ధి సాధించి, బ్రహ్మ-జ్ఞానములో స్థితులై ఉన్నవారిని వివరిస్తుంది. అటువంటి పరిపూర్ణ యోగులు కూడా తమ సిద్ధిలో పరిపూర్ణతని భక్తిలో నిమగ్నమవ్వటం ద్వారా అనుభవిస్తారు. ఈ విధంగా, సర్వోన్నత దివ్య మంగళ స్వరూప భగవంతుని యొక్క యదార్థ రహస్యమును ప్రేమయుక్త భక్తి ద్వారా మాత్రమే తెలుసుకోగలము.\n\t\t\tభగవంతుడు సర్వ భూతముల హృదయములో స్థితుడై ఉంటాడని, మరియు వాటి వాటి కర్మానుసారం వారిని త్రిప్పుతుంటాడని, శ్రీ కృష్ణుడు అర్జునుడికి గుర్తుచేస్తాడు. భగవంతుడినే స్మరిస్తూ, మన అన్ని కార్యకలాపములను ఆయనకే అర్పితం చేసి, ఆయన ఆశ్రయం పొంది, ఆయనే మన పరమ లక్ష్యముగా చేసుకుంటే, ఆ తదుపరి ఆయన కృప ద్వారా మనము అన్ని క్లేశములను, అవరోధాలను అధిగమించగలము. కానీ, దురభిమానంతో, మన ఇష్టంవచ్చినట్టు ప్రవర్తిస్తే, మనకు విజయం/సఫలత లభించదు. చిట్టచివరికి శ్రీ కృష్ణుడు అత్యంత గుహ్యమైన జ్ఞానమును తెలియచేస్తూ, సర్వ ధర్మములనూ త్యజించి కేవలం భగవంతునికే శరణాగతి చేయమంటాడు. కానీ, ఈ జ్ఞానమును సాధుచిత్తులూ, భక్తులు కాని వారికి ఇవ్వకూడదు అని అంటున్నాడు, ఎందుకంటే దానిని వారు తప్పుగా అర్థం చేసుకుని, బాధ్యతారహితముగా కర్మలను పరిత్యాగం చేసే ప్రమాదం ఉంటుంది. కానీ, ఈ రహస్య జ్ఞానమును అర్హులైన జీవులకు అందిస్తే, అది అత్యున్నత ప్రేమతో చేసేపని అవుతుంది మరియు అది భగవంతునికి అత్యంత ప్రీతికరమయినది. \n\t\t\t    తన మోహము/భ్రాంతి నిర్మూలించబడినవి అని, తాను ఇప్పుడు, చెప్పినట్టు చేయటానికి తయారుగా ఉన్నానని అర్జునుడు ఆ తరువాత శ్రీ కృష్ణుడికి తెలియచేస్తాడు. చివరలో, అంధుడైన ధృతరాష్ట్ర మహారాజుకి ఈ (కృష్ణార్జున) సంవాదమును వినిపిస్తున్న సంజయుడు, ఆ దివ్య సంభాషణను వింటూ తాను ఎంత ఆశ్చర్యానికి, దిగ్భ్రాంతికి లోనయ్యాడో చెప్తాడు. ఆ యొక్క పవిత్ర సంభాషణని, మరియు మహాద్భుత విశ్వరూపమును గుర్తుచేసుకుంటే ఆయన యొక్క రోమములు మహదానందముతో నిక్కబొడుచుకుంటాయి. భగవంతుడు మరియు ఆయన పరిశుద్ధ భక్తుడు ఎక్కడుంటే, వారి పక్షమే విజయం ఎల్లప్పుడూ ఉంటుంది; అంతేకాక, శుభమూ, విజయమూ, మరియు ఐశ్వర్యమూ కూడా వారి వద్దే ఉంటుంది, ఎందుకంటే అసత్యపు చీకటి ఖచ్చితంగా పరమ సత్యము యొక్క వెలుగుచే నిర్మూలించబడుతుంది - అనే ఒక గంభీరమైన ప్రకటనతో సంజయుడు దీనిని ముగిస్తున్నాడు.",
      verses: chapter18,
    },
  ];

  return chapters.find((chapter) => chapter.id === parseInt(id));
};

export default function ChapterScreen() {
  const { id } = useLocalSearchParams();
  const chapter = getChapterData(id as string);

  const renderVerse = ({
    item,
  }: {
    item: {
      id: string;
      chapter: number;
      verse_number: string;
      teluguSloka: string;
      meaning: string;
      word_meanings: { word: string; meaning: string }[];
      commentary: string;
    };
  }) => {
    if (!chapter) return null;
    return (
      <Link href={`/verse/${chapter.id}-${item.verse_number}`} asChild>
        <Pressable style={chapterstyles.verseCard}>
          <View style={chapterstyles.verseContent}>
            <Text style={chapterstyles.verseNumber}>
              Verse {item.verse_number}
            </Text>
            {/* <Text style={chapterstyles.sanskritText}>{item.sanskrit}</Text> */}
            <Text style={chapterstyles.teluguSloka}>{item.teluguSloka}</Text>
            {/* <Text style={chapterstyles.translation}>{item.translation}</Text> */}
          </View>
        </Pressable>
      </Link>
    );
  };

  if (!chapter) {
    return (
      <SafeAreaView style={chapterstyles.container}>
        <Text>Chapter not found</Text>
      </SafeAreaView>
    );
  }

  return (
    <SafeAreaView style={chapterstyles.container}>
      <Stack.Screen
        options={{
          headerTitle: `Chapter ${chapter.id}`,
          headerShown: true,
          headerStyle: {
            backgroundColor: "#FFF8E7",
          },
          headerShadowVisible: false,
        }}
      />

      <FlatList
        data={chapter.verses}
        renderItem={renderVerse}
        keyExtractor={(item) => item.verse_number.toString()}
        contentContainerStyle={chapterstyles.listContainer}
        ListHeaderComponent={
          <View>
            <View style={chapterstyles.header}>
              <Text style={chapterstyles.chapterName}>
                {chapter.chapter_number}
              </Text>
              <Text style={chapterstyles.sanskritName}>
                {chapter.yogam_name}
              </Text>
            </View>
            <View style={chapterstyles.descriptionCard}>
              <Text style={chapterstyles.descriptionText}>
                {chapter.description}
              </Text>
            </View>
          </View>
        }
      />
    </SafeAreaView>
  );
}
